# Aula 5: Pandas e Numpy

Pandas e NumPy são duas bibliotecas muito importantes para se trabalhar com dados no python.

A biblioteca NumPy que é bastante utilizada na academia para programação numérica

Já o Pandas é utilizado predominantemente para Data Visualization e para Data Analysis

In [3]:
import numpy as np

#### Vetorização

NumPy é excelente para operações com vetores.

Operações do tipo:

- multiplicação matricial e outras operações de álgebra linear  
- vetores de número aleatório  
- aplicação de transformação (ex., seno, cosseno, log, ...)

Vamos tentar criar duas matrizes utilizando listas. Uma 3 x 3 e outra um vetor 1 x 3:

In [186]:
a = [[ 5, 1 ,3], [ 1, 1 ,1], [ 1, 2 ,1]]
b = [1, 2, 3]
print(a)
print(b)
print(a*b)

[[5, 1, 3], [1, 1, 1], [1, 2, 1]]
[1, 2, 3]

TypeError: can't multiply sequence by non-int of type 'list'

In [187]:
2*3

6

Como podemos observar não conseguimos multiplicar essas duas listas. Analisando o erro fica claro que não podemos multiplicar uma lista por uma outra lista.

#### NumPy Arrays

A coisa mais importante que o NumPy define é um **array** N-dimensional formalmente denominado de [numpy.ndarray](http://docs.scipy.org/doc/numpy/reference/arrays.ndarray.html)

Podemos, então, recriar os vetores *a e b* como NumPy arrays e obter sua multiplicação da seguinte maneira:

In [191]:
a = np.array([[ 5, 1 ,3], [ 1, 1 ,1], [ 1, 2 ,1]])
b = np.array([1, 2, 3])
print(a*b)

[[5 2 9]
 [1 2 3]
 [1 4 3]]

Observe, porém, que a multiplicação foi realizada elemento por elemento.

Não obtivemos uma multiplicação matricial. Voltaremos a este problema mais tarde

NumPy arrays são parecidos com listas exceto que:

- As entradas devem ser *homogeneas* (elementos do mesmo tipo)  
- Esses tipos devem ser um dos tipos (`dtypes`) suportados pelo NumPy  


Os tipos mais importantes são:

- float64: 64 bit número em ponto flutuante  
- int64: 64 bit inteiro  
- bool:  8 bit True ou False  

Podemos obter o tipo de um objeto da seguinte maneira:

In [192]:
type(a), type(a[0][0])

(numpy.ndarray, numpy.int64)

In [190]:
a[0][0]

5

Para se obter a multiplicação matricial, devemod utilizar ".dot". Por exemplo:

In [6]:
print(a.dot(b))

[16  6  8]

Ainda assim nossa multiplicação não esta correta dado que estamos multiplicando uma matrix 3 x 3 por uma 1 x 3.

Redefinindo *b* da forma correta podemos obter a multiplicação matricial:

In [194]:
b = np.array([[1], [2], [3]])
print(b)
print("/n")
print(a.dot(b))

[[1]
 [2]
 [3]]
/n
[[16]
 [ 6]
 [ 8]]

Há uma outra maneira de se definir uma matriz. Essa envolve a utilização de [numpy.matrix](https://docs.scipy.org/doc/numpy/reference/generated/numpy.matrix.html)

Definindo-se dessa maneira as matrizes, podemos utilizar a operação produto (*), para multiplica-las:

In [195]:
a = np.matrix('[5, 1 ,3; 1, 1 ,1; 1, 2 ,1]')
b = np.matrix('[1; 2; 3]')
print(a)
a * b

[[5 1 3]
 [1 1 1]
 [1 2 1]]

matrix([[16],
        [ 6],
        [ 8]])

Podemos obter a transposta de diferentes maneiras:

In [10]:
a.transpose()

matrix([[5, 1, 1],
        [1, 1, 2],
        [3, 1, 1]])

In [11]:
a.T

matrix([[5, 1, 1],
        [1, 1, 2],
        [3, 1, 1]])

E a Inversa de uma matriz

In [12]:
a.getI()

matrix([[ 5.00000000e-01, -2.50000000e+00,  1.00000000e+00],
        [ 9.25185854e-18, -1.00000000e+00,  1.00000000e+00],
        [-5.00000000e-01,  4.50000000e+00, -2.00000000e+00]])

In [13]:
a.I

matrix([[ 5.00000000e-01, -2.50000000e+00,  1.00000000e+00],
        [ 9.25185854e-18, -1.00000000e+00,  1.00000000e+00],
        [-5.00000000e-01,  4.50000000e+00, -2.00000000e+00]])

No mais, NumPy arrays podem ser criados a partir de listas utilizando np.array

In [196]:
lista = [10, 20]
np.array(lista)

array([10, 20])

In [203]:
a

matrix([[1, 3, 5],
        [1, 1, 1],
        [1, 1, 2]])

In [202]:
a.mean()

1.7777777777777777

##### Métodos em um Array

In [210]:
a = np.array([5, 4, 3, 2, 1])
a

array([5, 4, 3, 2, 1])

In [206]:
a.sort()
a

array([1, 2, 3, 4])

In [207]:
a.sum()

10

In [208]:
a.mean()

2.5

In [211]:
np.median(a)

3.0

In [84]:
a.max()

4

### PANDAS

Pandas será, provavelmente, a biblioteca mais utilizada por nós daqui em diante. Realizaremos quase todas as operações com dados nela. Importar, maniputar, salvar, estimar, ...

In [5]:
import pandas as pd

In [12]:
pd.read_csv("ex_save_filmes.csv")

                                                 nome        obs  rate
0                               Dunkirk (2017) - IMDb    543.268   7.9
1   Piratas do Caribe: A Vinganca de Salazar (2017...    259.112   6.6
2         Soul Surfer: Coragem de Viver (2011) - IMDb     45.257   7.0
3              Top Gun: Ases Indomaveis (1986) - IMDb    291.570   6.9
4                  A Lista de Schindler (1993) - IMDb  1.198.580   8.9
5                               Dunkirk (2017) - IMDb    543.268   7.9
6   Piratas do Caribe: A Vinganca de Salazar (2017...    259.112   6.6
7         Soul Surfer: Coragem de Viver (2011) - IMDb     45.257   7.0
8              Top Gun: Ases Indomaveis (1986) - IMDb    291.570   6.9
9                  A Lista de Schindler (1993) - IMDb  1.198.580   8.9
10                   A Lista de Gustavo (2020) - IMDb  1.198.580   8.9

Podemos ler um arquivo em formato CSV, por exemplo, e transforma-lo em uma base (dataframe).

In [7]:
df1 = pd.read_csv("filmes.csv", header = None, names=['nome', 'obs', 'rate'])

In [13]:
df1

                                                 nome        obs  rate
0                               Dunkirk (2017) - IMDb    543.268   7.9
1   Piratas do Caribe: A Vinganca de Salazar (2017...    259.112   6.6
2         Soul Surfer: Coragem de Viver (2011) - IMDb     45.257   7.0
3              Top Gun: Ases Indomaveis (1986) - IMDb    291.570   6.9
4                  A Lista de Schindler (1993) - IMDb  1.198.580   8.9
5                               Dunkirk (2017) - IMDb    543.268   7.9
6   Piratas do Caribe: A Vinganca de Salazar (2017...    259.112   6.6
7         Soul Surfer: Coragem de Viver (2011) - IMDb     45.257   7.0
8              Top Gun: Ases Indomaveis (1986) - IMDb    291.570   6.9
9                  A Lista de Schindler (1993) - IMDb  1.198.580   8.9
10                   A Lista de Gustavo (2020) - IMDb  1.198.580   8.9

Salvar uma base de dados em csv.

In [11]:
df1.to_csv('ex_save_filmes.csv', index=False)

O mesmo pode-se aplicar para o [pickle](). Podemos ler e salvar bases de dados em pickle

In [14]:
dfp = pd.read_pickle("dados.pkl")

In [15]:
dfp

['KFD0001',
 'KFD0002',
 'KFD0003',
 'KFD0004',
 'KFD0005',
 'KFD0006',
 'KFD0007',
 'KFD0008',
 'KFD0009',
 'KFD0010',
 'KFD0011',
 'KFD0012',
 'KFD0013',
 'KFD0014',
 'KFD0015',
 'KFD0016',
 'KFD0017',
 'KFD0018',
 'KFD0019',
 'KFD0020',
 'KFD0021',
 'KFD0022',
 'KFD0023',
 'KFD0024',
 'KFD0025',
 'KFD0026',
 'KFD0027',
 'KFD0028',
 'KFD0029',
 'KFD0030',
 'KFD0031',
 'KFD0032',
 'KFD0033',
 'KFD0034',
 'KFD0035',
 'KFD0036',
 'KFD0037',
 'KFD0038',
 'KFD0039',
 'KFD0040',
 'KFD0041',
 'KFD0042',
 'KFD0043',
 'KFD0044',
 'KFD0045',
 'KFD0046',
 'KFD0047',
 'KFD0048',
 'KFD0049',
 'KFD0050',
 'KFD0051',
 'KFD0052',
 'KFD0053',
 'KFD0054',
 'KFD0055',
 'KFD0056',
 'KFD0057',
 'KFD0058',
 'KFD0059',
 'KFD0060',
 'KFD0061',
 'KFD0062',
 'KFD0063',
 'KFD0064',
 'KFD0065',
 'KFD0066',
 'KFD0067',
 'KFD0068',
 'KFD0069',
 'KFD0070',
 'KFD0071',
 'KFD0072',
 'KFD0073',
 'KFD0074',
 'KFD0075',
 'KFD0076',
 'KFD0077',
 'KFD0078',
 'KFD0079',
 'KFD0080',
 'KFD0081',
 'KFD0082',
 'KFD0083',
 'KFD0084',
 'KFD0085',
 'KFD0086',
 'KFD0087',
 'KFD0088',
 'KFD0089',
 'KFD0090',
 'KFD0091',
 'KFD0092',
 'KFD0093',
 'KFD0094',
 'KFD0095',
 'KFD0096',
 'KFD0097',
 'KFD0098',
 'KFD0099',
 'KFD0100',
 'KFD0101',
 'KFD0102',
 'KFD0103',
 'KFD0104',
 'KFD0105',
 'KFD0106',
 'KFD0107',
 'KFD0108',
 'KFD0109',
 'KFD0110',
 'KFD0111',
 'KFD0112',
 'KFD0113',
 'KFD0114',
 'KFD0115',
 'KFD0116',
 'KFD0117',
 'KFD0118',
 'KFD0119',
 'KFD0120',
 'KFD0121',
 'KFD0122',
 'KFD0123',
 'KFD0124',
 'KFD0125',
 'KFD0126',
 'KFD0127',
 'KFD0128',
 'KFD0129',
 'KFD0130',
 'KFD0131',
 'KFD0132',
 'KFD0133',
 'KFD0134',
 'KFD0135',
 'KFD0136',
 'KFD0137',
 'KFD0138',
 'KFD0139',
 'KFD0140',
 'KFD0141',
 'KFD0142',
 'KFD0143',
 'KFD0144',
 'KFD0145',
 'KFD0146',
 'KFD0147',
 'KFD0148',
 'KFD0149',
 'KFD0150',
 'KFD0151',
 'KFD0152',
 'KFD0153',
 'KFD0154',
 'KFD0155',
 'KFD0156',
 'KFD0157',
 'KFD0158',
 'KFD0159',
 'KFD0160',
 'KFD0161',
 'KFD0162',
 'KFD0163',
 'KFD0164',
 'KFD0165',
 'KFD0166',
 'KFD0167',
 'KFD0168',
 'KFD0169',
 'KFD0170',
 'KFD0171',
 'KFD0172',
 'KFD0173',
 'KFD0174',
 'KFD0175',
 'KFD0176',
 'KFD0177',
 'KFD0178',
 'KFD0179',
 'KFD0180',
 'KFD0181',
 'KFD0182',
 'KFD0183',
 'KFD0184',
 'KFD0185',
 'KFD0186',
 'KFD0187',
 'KFD0188',
 'KFD0189',
 'KFD0190',
 'KFD0191',
 'KFD0192',
 'KFD0193',
 'KFD0194',
 'KFD0195',
 'KFD0196',
 'KFD0197',
 'KFD0198',
 'KFD0199',
 'KFD0200',
 'KFD0201',
 'KFD0202',
 'KFD0203',
 'KFD0204',
 'KFD0205',
 'KFD0206',
 'KFD0207',
 'KFD0208',
 'KFD0209',
 'KFD0210',
 'KFD0211',
 'KFD0212',
 'KFD0213',
 'KFD0214',
 'KFD0215',
 'KFD0216',
 'KFD0217',
 'KFD0218',
 'KFD0219',
 'KFD0220',
 'KFD0221',
 'KFD0222',
 'KFD0223',
 'KFD0224',
 'KFD0225',
 'KFD0226',
 'KFD0227',
 'KFD0228',
 'KFD0229',
 'KFD0230',
 'KFD0231',
 'KFD0232',
 'KFD0233',
 'KFD0234',
 'KFD0235',
 'KFD0236',
 'KFD0237',
 'KFD0238',
 'KFD0239',
 'KFD0240',
 'KFD0241',
 'KFD0242',
 'KFD0243',
 'KFD0244',
 'KFD0245',
 'KFD0246',
 'KFD0247',
 'KFD0248',
 'KFD0249',
 'KFD0250',
 'KFD0251',
 'KFD0252',
 'KFD0253',
 'KFD0254',
 'KFD0255',
 'KFD0256',
 'KFD0257',
 'KFD0258',
 'KFD0259',
 'KFD0260',
 'KFD0261',
 'KFD0262',
 'KFD0263',
 'KFD0264',
 'KFD0265',
 'KFD0266',
 'KFD0267',
 'KFD0268',
 'KFD0269',
 'KFD0270',
 'KFD0271',
 'KFD0272',
 'KFD0273',
 'KFD0274',
 'KFD0275',
 'KFD0276',
 'KFD0277',
 'KFD0278',
 'KFD0279',
 'KFD0280',
 'KFD0281',
 'KFD0282',
 'KFD0283',
 'KFD0284',
 'KFD0285',
 'KFD0286',
 'KFD0287',
 'KFD0288',
 'KFD0289',
 'KFD0290',
 'KFD0291',
 'KFD0292',
 'KFD0293',
 'KFD0294',
 'KFD0295',
 'KFD0296',
 'KFD0297',
 'KFD0298',
 'KFD0299',
 'KFD0300',
 'KFD0301',
 'KFD0302',
 'KFD0303',
 'KFD0304',
 'KFD0305',
 'KFD0306',
 'KFD0307',
 'KFD0308',
 'KFD0309',
 'KFD0310',
 'KFD0311',
 'KFD0312',
 'KFD0313',
 'KFD0314',
 'KFD0315',
 'KFD0316',
 'KFD0317',
 'KFD0318',
 'KFD0319',
 'KFD0320',
 'KFD0321',
 'KFD0322',
 'KFD0323',
 'KFD0324',
 'KFD0325',
 'KFD0326',
 'KFD0327',
 'KFD0328',
 'KFD0329',
 'KFD0330',
 'KFD0331',
 'KFD0332',
 'KFD0333',
 'KFD0334',
 'KFD0335',
 'KFD0336',
 'KFD0337',
 'KFD0338',
 'KFD0339',
 'KFD0340',
 'KFD0341',
 'KFD0342',
 'KFD0343',
 'KFD0344',
 'KFD0345',
 'KFD0346',
 'KFD0347',
 'KFD0348',
 'KFD0349',
 'KFD0350',
 'KFD0351',
 'KFD0352',
 'KFD0353',
 'KFD0354',
 'KFD0355',
 'KFD0356',
 'KFD0357',
 'KFD0358',
 'KFD0359',
 'KFD0360',
 'KFD0361',
 'KFD0362',
 'KFD0363',
 'KFD0364',
 'KFD0365',
 'KFD0366',
 'KFD0367',
 'KFD0368',
 'KFD0369',
 'KFD0370',
 'KFD0371',
 'KFD0372',
 'KFD0373',
 'KFD0374',
 'KFD0375',
 'KFD0376',
 'KFD0377',
 'KFD0378',
 'KFD0379',
 'KFD0380',
 'KFD0381',
 'KFD0382',
 'KFD0383',
 'KFD0384',
 'KFD0385',
 'KFD0386',
 'KFD0387',
 'KFD0388',
 'KFD0389',
 'KFD0390',
 'KFD0391',
 'KFD0392',
 'KFD0393',
 'KFD0394',
 'KFD0395',
 'KFD0396',
 'KFD0397',
 'KFD0398',
 'KFD0399',
 'KFD0400',
 'KFD0401',
 'KFD0402',
 'KFD0403',
 'KFD0404',
 'KFD0405',
 'KFD0406',
 'KFD0407',
 'KFD0408',
 'KFD0409',
 'KFD0410',
 'KFD0411',
 'KFD0412',
 'KFD0413',
 'KFD0414',
 'KFD0415',
 'KFD0416',
 'KFD0417',
 'KFD0418',
 'KFD0419',
 'KFD0420',
 'KFD0421',
 'KFD0422',
 'KFD0423',
 'KFD0424',
 'KFD0425',
 'KFD0426',
 'KFD0427',
 'KFD0428',
 'KFD0429',
 'KFD0430',
 'KFD0431',
 'KFD0432',
 'KFD0433',
 'KFD0434',
 'KFD0435',
 'KFD0436',
 'KFD0437',
 'KFD0438',
 'KFD0439',
 'KFD0440',
 'KFD0441',
 'KFD0442',
 'KFD0443',
 'KFD0444',
 'KFD0445',
 'KFD0446',
 'KFD0447',
 'KFD0448',
 'KFD0449',
 'KFD0450',
 'KFD0451',
 'KFD0452',
 'KFD0453',
 'KFD0454',
 'KFD0455',
 'KFD0456',
 'KFD0457',
 'KFD0458',
 'KFD0459',
 'KFD0460',
 'KFD0461',
 'KFD0462',
 'KFD0463',
 'KFD0464',
 'KFD0465',
 'KFD0466',
 'KFD0467',
 'KFD0468',
 'KFD0469',
 'KFD0470',
 'KFD0471',
 'KFD0472',
 'KFD0473',
 'KFD0474',
 'KFD0475',
 'KFD0476',
 'KFD0477',
 'KFD0478',
 'KFD0479',
 'KFD0480',
 'KFD0481',
 'KFD0482',
 'KFD0483',
 'KFD0484',
 'KFD0485',
 'KFD0486',
 'KFD0487',
 'KFD0488',
 'KFD0489',
 'KFD0490',
 'KFD0491',
 'KFD0492',
 'KFD0493',
 'KFD0494',
 'KFD0495',
 'KFD0496',
 'KFD0497',
 'KFD0498',
 'KFD0499',
 'KFD0500',
 'KFD0501',
 'KFD0502',
 'KFD0503',
 'KFD0504',
 'KFD0505',
 'KFD0506',
 'KFD0507',
 'KFD0508',
 'KFD0509',
 'KFD0510',
 'KFD0511',
 'KFD0512',
 'KFD0513',
 'KFD0514',
 'KFD0515',
 'KFD0516',
 'KFD0517',
 'KFD0518',
 'KFD0519',
 'KFD0520',
 'KFD0521',
 'KFD0522',
 'KFD0523',
 'KFD0524',
 'KFD0525',
 'KFD0526',
 'KFD0527',
 'KFD0528',
 'KFD0529',
 'KFD0530',
 'KFD0531',
 'KFD0532',
 'KFD0533',
 'KFD0534',
 'KFD0535',
 'KFD0536',
 'KFD0537',
 'KFD0538',
 'KFD0539',
 'KFD0540',
 'KFD0541',
 'KFD0542',
 'KFD0543',
 'KFD0544',
 'KFD0545',
 'KFD0546',
 'KFD0547',
 'KFD0548',
 'KFD0549',
 'KFD0550',
 'KFD0551',
 'KFD0552',
 'KFD0553',
 'KFD0554',
 'KFD0555',
 'KFD0556',
 'KFD0557',
 'KFD0558',
 'KFD0559',
 'KFD0560',
 'KFD0561',
 'KFD0562',
 'KFD0563',
 'KFD0564',
 'KFD0565',
 'KFD0566',
 'KFD0567',
 'KFD0568',
 'KFD0569',
 'KFD0570',
 'KFD0571',
 'KFD0572',
 'KFD0573',
 'KFD0574',
 'KFD0575',
 'KFD0576',
 'KFD0577',
 'KFD0578',
 'KFD0579',
 'KFD0580',
 'KFD0581',
 'KFD0582',
 'KFD0583',
 'KFD0584',
 'KFD0585',
 'KFD0586',
 'KFD0587',
 'KFD0588',
 'KFD0589',
 'KFD0590',
 'KFD0591',
 'KFD0592',
 'KFD0593',
 'KFD0594',
 'KFD0595',
 'KFD0596',
 'KFD0597',
 'KFD0598',
 'KFD0599',
 'KFD0600',
 'KFD0601',
 'KFD0602',
 'KFD0603',
 'KFD0604',
 'KFD0605',
 'KFD0606',
 'KFD0607',
 'KFD0608',
 'KFD0609',
 'KFD0610',
 'KFD0611',
 'KFD0612',
 'KFD0613',
 'KFD0614',
 'KFD0615',
 'KFD0616',
 'KFD0617',
 'KFD0618',
 'KFD0619',
 'KFD0620',
 'KFD0621',
 'KFD0622',
 'KFD0623',
 'KFD0624',
 'KFD0625',
 'KFD0626',
 'KFD0627',
 'KFD0628',
 'KFD0629',
 'KFD0630',
 'KFD0631',
 'KFD0632',
 'KFD0633',
 'KFD0634',
 'KFD0635',
 'KFD0636',
 'KFD0637',
 'KFD0638',
 'KFD0639',
 'KFD0640',
 'KFD0641',
 'KFD0642',
 'KFD0643',
 'KFD0644',
 'KFD0645',
 'KFD0646',
 'KFD0647',
 'KFD0648',
 'KFD0649',
 'KFD0650',
 'KFD0651',
 'KFD0652',
 'KFD0653',
 'KFD0654',
 'KFD0655',
 'KFD0656',
 'KFD0657',
 'KFD0658',
 'KFD0659',
 'KFD0660',
 'KFD0661',
 'KFD0662',
 'KFD0663',
 'KFD0664',
 'KFD0665',
 'KFD0666',
 'KFD0667',
 'KFD0668',
 'KFD0669',
 'KFD0670',
 'KFD0671',
 'KFD0672',
 'KFD0673',
 'KFD0674',
 'KFD0675',
 'KFD0676',
 'KFD0677',
 'KFD0678',
 'KFD0679',
 'KFD0680',
 'KFD0681',
 'KFD0682',
 'KFD0683',
 'KFD0684',
 'KFD0685',
 'KFD0686',
 'KFD0687',
 'KFD0688',
 'KFD0689',
 'KFD0690',
 'KFD0691',
 'KFD0692',
 'KFD0693',
 'KFD0694',
 'KFD0695',
 'KFD0696',
 'KFD0697',
 'KFD0698',
 'KFD0699',
 'KFD0700',
 'KFD0701',
 'KFD0702',
 'KFD0703',
 'KFD0704',
 'KFD0705',
 'KFD0706',
 'KFD0707',
 'KFD0708',
 'KFD0709',
 'KFD0710',
 'KFD0711',
 'KFD0712',
 'KFD0713',
 'KFD0714',
 'KFD0715',
 'KFD0716',
 'KFD0717',
 'KFD0718',
 'KFD0719',
 'KFD0720',
 'KFD0721',
 'KFD0722',
 'KFD0723',
 'KFD0724',
 'KFD0725',
 'KFD0726',
 'KFD0727',
 'KFD0728',
 'KFD0729',
 'KFD0730',
 'KFD0731',
 'KFD0732',
 'KFD0733',
 'KFD0734',
 'KFD0735',
 'KFD0736',
 'KFD0737',
 'KFD0738',
 'KFD0739',
 'KFD0740',
 'KFD0741',
 'KFD0742',
 'KFD0743',
 'KFD0744',
 'KFD0745',
 'KFD0746',
 'KFD0747',
 'KFD0748',
 'KFD0749',
 'KFD0750',
 'KFD0751',
 'KFD0752',
 'KFD0753',
 'KFD0754',
 'KFD0755',
 'KFD0756',
 'KFD0757',
 'KFD0758',
 'KFD0759',
 'KFD0760',
 'KFD0761',
 'KFD0762',
 'KFD0763',
 'KFD0764',
 'KFD0765',
 'KFD0766',
 'KFD0767',
 'KFD0768',
 'KFD0769',
 'KFD0770',
 'KFD0771',
 'KFD0772',
 'KFD0773',
 'KFD0774',
 'KFD0775',
 'KFD0776',
 'KFD0777',
 'KFD0778',
 'KFD0779',
 'KFD0780',
 'KFD0781',
 'KFD0782',
 'KFD0783',
 'KFD0784',
 'KFD0785',
 'KFD0786',
 'KFD0787',
 'KFD0788',
 'KFD0789',
 'KFD0790',
 'KFD0791',
 'KFD0792',
 'KFD0793',
 'KFD0794',
 'KFD0795',
 'KFD0796',
 'KFD0797',
 'KFD0798',
 'KFD0799',
 'KFD0800',
 'KFD0801',
 'KFD0802',
 'KFD0803',
 'KFD0804',
 'KFD0805',
 'KFD0806',
 'KFD0807',
 'KFD0808',
 'KFD0809',
 'KFD0810',
 'KFD0811',
 'KFD0812',
 'KFD0813',
 'KFD0814',
 'KFD0815',
 'KFD0816',
 'KFD0817',
 'KFD0818',
 'KFD0819',
 'KFD0820',
 'KFD0821',
 'KFD0822',
 'KFD0823',
 'KFD0824',
 'KFD0825',
 'KFD0826',
 'KFD0827',
 'KFD0828',
 'KFD0829',
 'KFD0830',
 'KFD0831',
 'KFD0832',
 'KFD0833',
 'KFD0834',
 'KFD0835',
 'KFD0836',
 'KFD0837',
 'KFD0838',
 'KFD0839',
 'KFD0840',
 'KFD0841',
 'KFD0842',
 'KFD0843',
 'KFD0844',
 'KFD0845',
 'KFD0846',
 'KFD0847',
 'KFD0848',
 'KFD0849',
 'KFD0850',
 'KFD0851',
 'KFD0852',
 'KFD0853',
 'KFD0854',
 'KFD0855',
 'KFD0856',
 'KFD0857',
 'KFD0858',
 'KFD0859',
 'KFD0860',
 'KFD0861',
 'KFD0862',
 'KFD0863',
 'KFD0864',
 'KFD0865',
 'KFD0866',
 'KFD0867',
 'KFD0868',
 'KFD0869',
 'KFD0870',
 'KFD0871',
 'KFD0872',
 'KFD0873',
 'KFD0874',
 'KFD0875',
 'KFD0876',
 'KFD0877',
 'KFD0878',
 'KFD0879',
 'KFD0880',
 'KFD0881',
 'KFD0882',
 'KFD0883',
 'KFD0884',
 'KFD0885',
 'KFD0886',
 'KFD0887',
 'KFD0888',
 'KFD0889',
 'KFD0890',
 'KFD0891',
 'KFD0892',
 'KFD0893',
 'KFD0894',
 'KFD0895',
 'KFD0896',
 'KFD0897',
 'KFD0898',
 'KFD0899',
 'KFD0900',
 'KFD0901',
 'KFD0902',
 'KFD0903',
 'KFD0904',
 'KFD0905',
 'KFD0906',
 'KFD0907',
 'KFD0908',
 'KFD0909',
 'KFD0910',
 'KFD0911',
 'KFD0912',
 'KFD0913',
 'KFD0914',
 'KFD0915',
 'KFD0916',
 'KFD0917',
 'KFD0918',
 'KFD0919',
 'KFD0920',
 'KFD0921',
 'KFD0922',
 'KFD0923',
 'KFD0924',
 'KFD0925',
 'KFD0926',
 'KFD0927',
 'KFD0928',
 'KFD0929',
 'KFD0930',
 'KFD0931',
 'KFD0932',
 'KFD0933',
 'KFD0934',
 'KFD0935',
 'KFD0936',
 'KFD0937',
 'KFD0938',
 'KFD0939',
 'KFD0940',
 'KFD0941',
 'KFD0942',
 'KFD0943',
 'KFD0944',
 'KFD0945',
 'KFD0946',
 'KFD0947',
 'KFD0948',
 'KFD0949',
 'KFD0950',
 'KFD0951',
 'KFD0952',
 'KFD0953',
 'KFD0954',
 'KFD0955',
 'KFD0956',
 'KFD0957',
 'KFD0958',
 'KFD0959',
 'KFD0960',
 'KFD0961',
 'KFD0962',
 'KFD0963',
 'KFD0964',
 'KFD0965',
 'KFD0966',
 'KFD0967',
 'KFD0968',
 'KFD0969',
 'KFD0970',
 'KFD0971',
 'KFD0972',
 'KFD0973',
 'KFD0974',
 'KFD0975',
 'KFD0976',
 'KFD0977',
 'KFD0978',
 'KFD0979',
 'KFD0980',
 'KFD0981',
 'KFD0982',
 'KFD0983',
 'KFD0984',
 'KFD0985',
 'KFD0986',
 'KFD0987',
 'KFD0988',
 'KFD0989',
 'KFD0990',
 'KFD0991',
 'KFD0992',
 'KFD0993',
 'KFD0994',
 'KFD0995',
 'KFD0996',
 'KFD0997',
 'KFD0998',
 'KFD0999',
 'KFD1000',
 ...]

In [16]:
dfp = pd.DataFrame(dfp)

In [17]:
dfp

               0
0        KFD0001
1        KFD0002
2        KFD0003
3        KFD0004
4        KFD0005
...          ...
3319663  PGZ9995
3319664  PGZ9996
3319665  PGZ9997
3319666  PGZ9998
3319667  PGZ9999

[3319668 rows x 1 columns]

In [1]:
import numpy as np

In [8]:
np.random.seed(567)

In [9]:
np.random.randn(10, 5)

array([[ 0.21326612, -0.09189941, -0.08934867,  0.26575572,  0.37606508],
       [ 0.6880254 ,  0.51000161,  1.91412049,  0.72477369,  0.12458787],
       [ 1.02339862,  2.22155722,  1.13090861, -0.65153792, -1.17998572],
       [ 0.43710148, -0.60710181,  1.31095368, -0.66690959, -0.38272924],
       [-1.03293277,  0.57399395, -1.18579928, -0.77424751, -1.19824265],
       [ 1.50057385, -0.75121542, -1.65168677,  0.91781965,  1.0166081 ],
       [-0.80994339,  0.89530748, -0.19849482, -0.07177955, -0.68935716],
       [ 0.09576015, -0.6762695 , -0.65038794,  0.78450845, -1.11962807],
       [ 0.48057002,  1.5662302 , -0.8464332 , -0.46807559, -0.06273988],
       [-0.74608775,  1.27634714, -0.8574931 , -1.04794698,  1.17552777]])

In [23]:
dfp.to_pickle("dados1.pkl")

Ou gerar uma base de dados com números aleatórios

In [31]:
df2 = pd.DataFrame(np.random.randn(10, 5))

In [35]:
seed = 37987384

In [28]:
df2

          0         1         2         3         4
0 -1.651627  0.439235 -1.295830 -1.408420  1.742969
1  1.337979  2.115730 -0.598289 -1.588779  0.586758
2  1.516860 -0.876056 -0.287875 -0.900494  0.509644
3 -0.766469  1.927199 -0.548617 -0.570509 -0.181030
4  1.230490  0.014691 -1.988748  0.528907 -0.194574
5  2.001604 -0.043797 -0.129556 -1.218252  0.452989
6 -0.728209  1.638407  1.361835 -1.148539 -0.259036
7  0.228667  0.393048  0.766833 -0.128999 -0.431908
8 -0.726983 -0.112497  1.110912 -1.016280  1.201225
9 -0.669580  1.843678 -0.135577  2.648826  0.808688

Array 10-por-5 de amostras de uma N(0, 1):

In [219]:
np.random.randn(10, 5)

array([[ 0.84295181, -0.96619706,  1.16497004, -0.92220646,  0.82853249],
       [-0.41312547, -1.08340072,  1.21650251, -1.48676318,  0.48600096],
       [ 0.57269407,  0.15900025, -0.1428501 ,  2.2589743 ,  2.31971776],
       [-0.56176225, -1.41845228, -0.04340897,  0.70246063, -0.28326958],
       [-0.05562229, -0.31360967, -0.48811437, -2.68338754,  1.73217544],
       [-0.03158561, -0.16209344, -0.41001849, -1.08217191,  2.24465082],
       [ 2.08824103, -0.69563586,  0.64432285, -1.80513222,  0.53939709],
       [ 0.09498621,  0.22614593,  1.52201799,  0.50595518,  0.80298507],
       [-0.97861146, -0.82759307,  0.46868302, -1.03713249,  1.57631076],
       [ 1.49444661,  0.34705101,  0.53928474, -0.61025996, -1.92329505]])

In [29]:
an = np.random.randn(10, 5)

In [30]:
pd.DataFrame(an)

          0         1         2         3         4
0 -0.415811  0.634043 -0.320084 -1.035141 -1.472318
1 -0.542063 -0.176143 -1.338999  1.164823  1.651221
2  0.204946  0.519608 -0.064065 -1.443523 -0.982411
3 -1.420311  0.993670  0.564678  0.244036 -1.161996
4  0.623735 -1.096172 -0.290833 -0.643554 -0.844381
5  1.050471  0.735425  0.435364 -0.240895 -1.215186
6  0.722506  1.076963  0.545667 -1.635789 -1.275542
7 -0.289325 -0.238281  0.952617 -0.144314  0.437175
8  0.897783 -0.674219  1.179446  1.552766  1.230427
9  0.984672  0.604761 -0.755868 -1.388132  0.026702

Array 10-por-5 de amostras de uma N(3, 6.25):

In [54]:
2.5 * np.random.randn(10, 5) + 3

array([[ 1.16136126,  1.5610962 ,  1.75928885,  3.33966496, -1.45634772],
       [-0.58605325,  6.45306227,  6.05554663,  2.17318412,  1.78031942],
       [ 3.15637957, -0.21794777, -5.50486352,  2.87625637,  1.50933237],
       [ 6.30665082,  8.83951451,  4.66675398,  3.3226557 ,  6.51439454],
       [-0.89216743,  5.08770786,  5.1808153 ,  3.92077871,  0.78901298],
       [ 6.01710123,  4.59706219, -0.34411691,  7.25530526, -0.31452625],
       [ 4.15758622,  4.2954792 ,  5.15074901,  9.75098855,  4.231685  ],
       [ 4.67886319,  2.66020067,  8.23684412,  4.41423504, -0.03136852],
       [ 2.46470453,  2.17928846,  4.83260918,  1.72097291,  7.08192576],
       [ 3.05218209,  3.05808709,  1.62407702,  4.89992492,  1.82366395]])

In [133]:
df_N3 = pd.DataFrame(2.5 * np.random.randn(1000000, 5) + 3)

In [134]:
df_N3

                0         1         2         3         4
0        4.183073  3.268869  1.304839  1.285205 -1.547286
1        0.135505  4.071374  2.016922  4.737354  5.446120
2       10.826263  1.088381  3.463748  3.529078  1.980847
3       -0.157899  3.281568  4.395266  0.293035  8.998278
4        6.430866  6.437216  6.442035  1.776596 -0.444714
...           ...       ...       ...       ...       ...
999995   1.952721  4.564140  0.532341  2.745993  4.106680
999996   0.011718  2.807503  5.116582  4.832581  5.161998
999997   2.355286  4.586091  3.717003  6.072489 -0.712566
999998   4.174209  5.718669  3.374314  1.877224  1.465869
999999   4.468878  1.419478  3.951339  6.307232  1.713951

[1000000 rows x 5 columns]

In [22]:
data = {
'País': ['Bélgica', 'Índia', 'Brasil'],
'Capital': ['Bruxelas', 'Nova Delhi', 'Brasília'],
'População': [123465, 456789, 987654]
}

In [23]:
df3 = pd.DataFrame(data, columns=['País','Capital','População'])

In [24]:
df3

      País     Capital  População
0  Bélgica    Bruxelas     123465
1    Índia  Nova Delhi     456789
2   Brasil    Brasília     987654

Podemos criar a mesma base através de uma lista de vários json's

In [225]:
data = [{"País":"Bélgica","Capital":"Bruxelas","População":123465},
        {"País":"Índia","Capital":"Nova Delhi","População":456789},
        {"País":"Brasil","Capital":"Brasília","População":987654}]

In [72]:
df4 = pd.DataFrame(data)

In [73]:
df4

      País     Capital  População
0  Bélgica    Bruxelas     123465
1    Índia  Nova Delhi     456789
2   Brasil    Brasília     987654

In [78]:
df4.drop([0,1])

     País   Capital  População
2  Brasil  Brasília     987654

É possível apagar linhas de um dataframe através do índice

In [80]:
df3 = df3.drop([0, 1])

In [82]:
df3.reset_index()

   index    País   Capital  População
0      2  Brasil  Brasília     987654

In [105]:
g = [('bird', 389.0),('bird', 24.0),('mammal', 80.5),('mammal', np.nan)]

In [106]:
g

[('bird', 389.0), ('bird', 24.0), ('mammal', 80.5), ('mammal', nan)]

In [107]:
df = pd.DataFrame(g,index=['falcon', 'parrot', 'lion', 'monkey'],columns=('class', 'max_speed'))

In [108]:
df

         class  max_speed
falcon    bird      389.0
parrot    bird       24.0
lion    mammal       80.5
monkey  mammal        NaN

In [94]:
df.reset_index()

    index   class  max_speed
0  falcon    bird      389.0
1  parrot    bird       24.0
2    lion  mammal       80.5
3  monkey  mammal       75.0

In [111]:
df3

      País     Capital  População
0  Bélgica    Bruxelas     123465
1    Índia  Nova Delhi     456789
2   Brasil    Brasília     987654

In [113]:
df3['País']

0    Bélgica
1      Índia
2     Brasil
Name: País, dtype: object

Ou remover colunas utilizando o argumento axis=1

In [96]:
df3.drop(['País','População'], axis=1)

      Capital
0    Bruxelas
1  Nova Delhi
2    Brasília

Coletando informações básicas sobre o DataFrame: 

Quantidade de linhas e colunas do DataFrame

In [97]:
df3.shape

(3, 3)

Descrição do Index

In [103]:
df3.index

RangeIndex(start=0, stop=3, step=1)

In [104]:
list(df3)

['País', 'Capital', 'População']

Colunas presentes no DataFrame

In [102]:
df3.columns

Index(['País', 'Capital', 'População'], dtype='object')

Contagem de dados não-nulos

In [110]:
df3.count()

País         3
Capital      3
População    3
dtype: int64

Criando uma nova coluna em um DataFrame

In [25]:
df3['Nova_Coluna'] = 0

In [26]:
df3

      País     Capital  População  Nova_Coluna
0  Bélgica    Bruxelas     123465            0
1    Índia  Nova Delhi     456789            0
2   Brasil    Brasília     987654            0

In [119]:
df3.columns

Index(['País', 'Capital', 'População', 'Nova_Coluna'], dtype='object')

Renomeando colunas de um DataFrame

Se seu DataFrame possui 3 colunas, passe 3 novos valores em uma lista

In [27]:
df3.columns = ['Coluna 1', 'Coluna 2', 'Coluna 3', 'Coluna 4']

In [28]:
df3

  Coluna 1    Coluna 2  Coluna 3  Coluna 4
0  Bélgica    Bruxelas    123465         0
1    Índia  Nova Delhi    456789         0
2   Brasil    Brasília    987654         0

Resumo dos dados

Soma dos valores de um DataFrame

In [122]:
df3.sum()

Coluna 1            BélgicaÍndiaBrasil
Coluna 2    BruxelasNova DelhiBrasília
Coluna 3                       1567908
Coluna 4                             0
dtype: object

Menor valor de um DataFrame

In [123]:
df3.min()

Coluna 1      Brasil
Coluna 2    Brasília
Coluna 3      123465
Coluna 4           0
dtype: object

Maior valor

In [124]:
df3.max()

Coluna 1         Índia
Coluna 2    Nova Delhi
Coluna 3        987654
Coluna 4             0
dtype: object

In [125]:
df3['Coluna 2']

0      Bruxelas
1    Nova Delhi
2      Brasília
Name: Coluna 2, dtype: object

Index do menor valor

In [127]:
df3["Coluna 3"].idxmin()

0

Index do maior valor

In [128]:
df3["Coluna 3"].idxmax()

2

Resumo estatístico do DataFrame, com quartis, mediana, etc.

In [130]:
pedro = df3.describe()

In [131]:
pedro

            Coluna 3  Coluna 4
count       3.000000       3.0
mean   522636.000000       0.0
std    435841.172317       0.0
min    123465.000000       0.0
25%    290127.000000       0.0
50%    456789.000000       0.0
75%    722221.500000       0.0
max    987654.000000       0.0

Vamos utilizar nossa base gerada a partir de uma Normal com média 3 e desvio 2.5

In [135]:
df_N3.describe()

,0,1,2,3,4
count,1000000.000000,1000000.000000,1000000.000000,1000000.000000,1000000.000000
mean,2.997966,3.002471,3.002204,2.999436,2.996050
std,2.503636,2.497715,2.499649,2.503210,2.501911
min,-8.762739,-8.533824,-9.316100,-9.065561,-9.716360
25%,1.310177,1.315095,1.315435,1.307754,1.306588
50%,2.996494,3.004351,3.002708,2.998233,2.992438
75%,4.687541,4.687013,4.686931,4.685119,4.685090
max,17.225809,15.326498,14.373999,14.544314,16.783190

Média dos valores

In [136]:
df3.mean()

Coluna 3    522636.0
Coluna 4         0.0
dtype: float64

Mediana dos valores

In [137]:
df3.median()

Coluna 3    456789.0
Coluna 4         0.0
dtype: float64

#### Funções Lambda

A função lambda é uma função anonima

Ela pode receber qualquer número de argumentos, mas só pode ter uma expressão.

In [1]:
def teste(a):
    b = a*3
    return b

In [3]:
teste(4)

12

In [5]:
(lambda a : a + 10)(10)

20

In [108]:
x = lambda a : a + 10
x(10)

20

In [7]:
d = lambda x:  x[0] - 2 * x[1] + 2
d([1,2])

-1

In [8]:
x = lambda a, b : a * b
x(5, 6)

30

In [10]:
def myfunc(n):
  return lambda a : a * n

In [12]:
mydoubler = myfunc(2)

In [13]:
mydoubler

In [14]:
mydoubler(11)

22

In [15]:
mytripler = myfunc(3)

In [16]:
mytripler(11)

33

In [17]:
myquad = myfunc(4)

In [18]:
myquad(4)

16

In [29]:
df3

  Coluna 1    Coluna 2  Coluna 3  Coluna 4
0  Bélgica    Bruxelas    123465         0
1    Índia  Nova Delhi    456789         0
2   Brasil    Brasília    987654         0

Aplicando funções:

Aplicando uma função que substitui 0 por 1

In [32]:
df3.apply(lambda x: x.replace(0, 1))

  Coluna 1    Coluna 2  Coluna 3  Coluna 4
0  Bélgica    Bruxelas    123465         1
1    Índia  Nova Delhi    456789         1
2   Brasil    Brasília    987654         1

Ordenando valores:

Ordenando em ordem crescente

In [33]:
df3.sort_values(by='Coluna 3')

  Coluna 1    Coluna 2  Coluna 3  Coluna 4
0  Bélgica    Bruxelas    123465         0
1    Índia  Nova Delhi    456789         0
2   Brasil    Brasília    987654         0

Ordenando em ordem decrescente

In [34]:
df3.sort_values(by='Coluna 3',ascending=False)

  Coluna 1    Coluna 2  Coluna 3  Coluna 4
2   Brasil    Brasília    987654         0
1    Índia  Nova Delhi    456789         0
0  Bélgica    Bruxelas    123465         0

Selecionando valores: 

Selecionando a primeira linha da coluna país

loc: seleciona linhas (ou colunas) com labels particulares do index.

iloc: seleciona linhas (ou colunas) em posições particulares do index (assume número inteiro).

In [35]:
df3

  Coluna 1    Coluna 2  Coluna 3  Coluna 4
0  Bélgica    Bruxelas    123465         0
1    Índia  Nova Delhi    456789         0
2   Brasil    Brasília    987654         0

In [37]:
df3['NC'] = 10

In [38]:
df3

  Coluna 1    Coluna 2  Coluna 3  Coluna 4  NC
0  Bélgica    Bruxelas    123465         0  10
1    Índia  Nova Delhi    456789         0  10
2   Brasil    Brasília    987654         0  10

In [40]:
df3[df3["Coluna 1"] == 'Brasil']

  Coluna 1  Coluna 2  Coluna 3  Coluna 4  NC
2   Brasil  Brasília    987654         0  10

In [41]:
df3[df3["Coluna 1"] == 'Bélgica']

  Coluna 1  Coluna 2  Coluna 3  Coluna 4  NC
0  Bélgica  Bruxelas    123465         0  10

In [42]:
df3

  Coluna 1    Coluna 2  Coluna 3  Coluna 4  NC
0  Bélgica    Bruxelas    123465         0  10
1    Índia  Nova Delhi    456789         0  10
2   Brasil    Brasília    987654         0  10

In [43]:
df3.loc[0, 'Coluna 1']

'Bélgica'

In [48]:
df3.iloc[0]['Coluna 1']

'Bélgica'

Suponha, agora, que queremos importar a base de dados AUTO em ".dta".

In [49]:
df4 = pd.read_stata("auto.dta")

In [54]:
df4.head()

,make,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio,foreign
0,AMC Concord,4099,22,3.0,2.5,11,2930,186,40,121,3.58,Domestic
1,AMC Pacer,4749,17,3.0,3.0,11,3350,173,40,258,2.53,Domestic
2,AMC Spirit,3799,22,NaN,3.0,12,2640,168,35,121,3.08,Domestic
3,Buick Century,4816,20,3.0,4.5,16,3250,196,40,196,2.93,Domestic
4,Buick Electra,7827,15,4.0,4.0,20,4080,222,43,350,2.41,Domestic

In [63]:
df4["price"].max()

15906

In [76]:
df4[df4["price"] == 15906]

,make,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio,foreign
12,Cad. Seville,15906,21,3.0,3.0,13,4290,204,45,350,2.24,Domestic

In [69]:
len(df4)

74

In [74]:
for i in range(len(df4)):
    preco = df4.iloc[i]['price']
    if preco == 15906:
        print(df4.iloc[i])
    else:
        continue

make            Cad. Seville
price                  15906
mpg                       21
rep78                      3
headroom                   3
trunk                     13
weight                  4290
length                   204
turn                      45
displacement             350
gear_ratio              2.24
foreign             Domestic
Name: 12, dtype: object

In [82]:
df4.sort_values(by='price',ascending=False).tail(10)

,make,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio,foreign
19,Dodge Colt,3984,30,5.0,2.0,8,2120,163,35,98,3.54,Domestic
18,Chev. Nova,3955,19,3.0,3.5,13,3430,197,43,250,2.56,Domestic
64,Renault Le Car,3895,26,3.0,3.0,10,1830,142,34,79,3.72,Foreign
28,Merc. Bobcat,3829,22,4.0,3.0,9,2580,169,39,140,2.73,Domestic
2,AMC Spirit,3799,22,NaN,3.0,12,2640,168,35,121,3.08,Domestic
65,Subaru,3798,35,5.0,2.5,11,2050,164,36,97,3.81,Foreign
67,Toyota Corolla,3748,31,5.0,3.0,9,2200,165,35,97,3.21,Foreign
17,Chev. Monza,3667,24,2.0,2.0,7,2750,179,40,151,2.73,Domestic
13,Chev. Chevette,3299,29,3.0,2.5,9,2110,163,34,231,2.93,Domestic
33,Merc. Zephyr,3291,20,3.0,3.5,17,2830,195,43,140,3.08,Domestic

In [56]:
print('Soma: ',         df4["price"].sum())
print('Valor máximo: ', df4["price"].max())
print('Valor mínimo: ', df4["price"].min())
print('Média',          df4["price"].mean())

Soma:  456229
Valor máximo:  15906
Valor mínimo:  3291
Média 6165.256756756757

Um outro comando bastante útil é o "value_counts". Com ele podemos contar a frequência de cada valor em um columa não numérica.

In [57]:
df4["foreign"].value_counts()

Domestic    52
Foreign     22
Name: foreign, dtype: int64

Pode-se, então, criar uma sub-base de dados baseada em valores específicos de uma coluna. Por exemplo, imagine que queremos apenas as informações dos carros importados.

In [58]:
df4[df4["foreign"] == 'Foreign']

,make,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio,foreign
52,Audi 5000,9690,17,5.0,3.0,15,2830,189,37,131,3.20,Foreign
53,Audi Fox,6295,23,3.0,2.5,11,2070,174,36,97,3.70,Foreign
54,BMW 320i,9735,25,4.0,2.5,12,2650,177,34,121,3.64,Foreign
55,Datsun 200,6229,23,4.0,1.5,6,2370,170,35,119,3.89,Foreign
56,Datsun 210,4589,35,5.0,2.0,8,2020,165,32,85,3.70,Foreign
57,Datsun 510,5079,24,4.0,2.5,8,2280,170,34,119,3.54,Foreign
58,Datsun 810,8129,21,4.0,2.5,8,2750,184,38,146,3.55,Foreign
59,Fiat Strada,4296,21,3.0,2.5,16,2130,161,36,105,3.37,Foreign
60,Honda Accord,5799,25,5.0,3.0,10,2240,172,36,107,3.05,Foreign
61,Honda Civic,4499,28,4.0,2.5,5,1760,149,34,91,3.30,Foreign
62,Mazda GLC,3995,30,4.0,3.5,11,1980,154,33,86,3.73,Foreign
63,Peugeot 604,12990,14,NaN,3.5,14,3420,192,38,163,3.58,Foreign
64,Renault Le Car,3895,26,3.0,3.0,10,1830,142,34,79,3.72,Foreign
65,Subaru,3798,35,5.0,2.5,11,2050,164,36,97,3.81,Foreign
66,Toyota Celica,5899,18,5.0,2.5,14,2410,174,36,134,3.06,Foreign
67,Toyota Corolla,3748,31,5.0,3.0,9,2200,165,35,97,3.21,Foreign
68,Toyota Corona,5719,18,5.0,2.0,11,2670,175,36,134,3.05,Foreign
69,VW Dasher,7140,23,4.0,2.5,12,2160,172,36,97,3.74,Foreign
70,VW Diesel,5397,41,5.0,3.0,15,2040,155,35,90,3.78,Foreign
71,VW Rabbit,4697,25,4.0,3.0,15,1930,155,35,89,3.78,Foreign
72,VW Scirocco,6850,25,4.0,2.0,16,1990,156,36,97,3.78,Foreign
73,Volvo 260,11995,17,5.0,2.5,14,3170,193,37,163,2.98,Foreign

In [59]:
df4_impot = df4[df4["foreign"] == 'Foreign'] # Dados carros importados
df4_nacio = df4[df4["foreign"] == 'Domestic']

In [60]:
df4_impot.head()

,make,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio,foreign
52,Audi 5000,9690,17,5.0,3.0,15,2830,189,37,131,3.20,Foreign
53,Audi Fox,6295,23,3.0,2.5,11,2070,174,36,97,3.70,Foreign
54,BMW 320i,9735,25,4.0,2.5,12,2650,177,34,121,3.64,Foreign
55,Datsun 200,6229,23,4.0,1.5,6,2370,170,35,119,3.89,Foreign
56,Datsun 210,4589,35,5.0,2.0,8,2020,165,32,85,3.70,Foreign

In [61]:
df4_nacio.head()

,make,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio,foreign
0,AMC Concord,4099,22,3.0,2.5,11,2930,186,40,121,3.58,Domestic
1,AMC Pacer,4749,17,3.0,3.0,11,3350,173,40,258,2.53,Domestic
2,AMC Spirit,3799,22,NaN,3.0,12,2640,168,35,121,3.08,Domestic
3,Buick Century,4816,20,3.0,4.5,16,3250,196,40,196,2.93,Domestic
4,Buick Electra,7827,15,4.0,4.0,20,4080,222,43,350,2.41,Domestic

Vamos observar o preço médio do carro importado.

In [62]:
print('Média Impot.: ',df4_impot["price"].mean())
print('Média Nacio.: ',df4_nacio["price"].mean())

Média Impot.:  6384.681818181818
Média Nacio.:  6072.423076923077

In [83]:
df_filmes = pd.DataFrame(columns=('name', 'obs', 'rate'))

In [84]:
df_filmes

Empty DataFrame
Columns: [name, obs, rate]
Index: []

In [86]:
len(df_filmes)

0

In [88]:
df_filmes.loc[0] = ['Teste', '50', '4']

In [89]:
df_filmes

    name obs rate
0  Teste  50    4

In [90]:
len(df_filmes)

1

In [95]:
df_filmes.loc[len(df_filmes)] = ['Teste', '50', '4']

In [100]:
df_filmes

NameError: name 'df_filmes' is not defined

In [97]:
len(df_filmes)

5

Deletar base de dados da memória

In [99]:
del(df_filmes)

In [9]:
df_filmes = pd.DataFrame(columns=('name', 'obs', 'rate'))

In [3]:
import requests
from bs4 import BeautifulSoup
import unicodedata
url = ['http://www.imdb.com/title/tt5013056/', 
       'http://www.imdb.com/title/tt1790809/',
       'http://www.imdb.com/title/tt1596346/',
       'http://www.imdb.com/title/tt0092099/',
       'http://www.imdb.com/title/tt0108052/']

In [4]:
def strip_accents(s):
    return ''.join(c for c in unicodedata.normalize('NFD', s) if unicodedata.category(c) != 'Mn')

In [10]:
for item in url:
    response = requests.get(item)
    soup = BeautifulSoup(response.text, 'lxml')
    name = strip_accents(soup.title.text)
    obs = soup.find_all("div", "AggregateRatingButton__TotalRatingAmount-sc-1ll29m0-3")[0].text
    rate = soup.find_all("span", "AggregateRatingButton__RatingScore-sc-1ll29m0-1")[0].text
    df_filmes.loc[len(df_filmes)] = [name, obs, rate]

In [11]:
df_filmes

                                                name   obs rate
0                              Dunkirk (2017) - IMDb  599K  7.8
1  Piratas do Caribe: A Vinganca de Salazar (2017...  282K  6.5
2        Soul Surfer: Coragem de Viver (2011) - IMDb   48K  7.0
3             Top Gun: Ases Indomaveis (1986) - IMDb  312K  6.9
4                 A Lista de Schindler (1993) - IMDb  1.3M  8.9

Podemos observar o tipo de variável. No caso de rate, ela é um object. Ou seja, não numérica.

In [12]:
df_filmes["rate"]

0    7.8
1    6.5
2    7.0
3    6.9
4    8.9
Name: rate, dtype: object

Neste caso, não conseguimos obter estatísticas

In [13]:
df_filmes["rate"].sum()

'7.86.57.06.98.9'

Mas podemos converter:

In [109]:
df_filmes["rate"] = pd.to_numeric(df_filmes["rate"])

In [110]:
df_filmes["rate"]

0    7.9
1    6.5
2    7.0
3    6.9
4    8.9
Name: rate, dtype: float64

In [111]:
df_filmes["rate"].sum()

37.199999999999996

In [112]:
df_filmes.dtypes

name     object
obs      object
rate    float64
dtype: object

In [113]:
print(df_filmes["rate"].sum())
print(df_filmes["rate"].max())
print(df_filmes["rate"].min())
print(df_filmes["rate"].mean())

37.199999999999996
8.9
6.5
7.4399999999999995

Uma outra operação importante é obter dummies. Iremos criar uma outra base com a dummies e depois juntar a base original

In [114]:
df_dum = pd.get_dummies(df_filmes['name'])

In [115]:
df_dum

,A Lista de Schindler (1993) - IMDb,Dunkirk (2017) - IMDb,Piratas do Caribe: A Vinganca de Salazar (2017) - IMDb,Soul Surfer: Coragem de Viver (2011) - IMDb,Top Gun: Ases Indomaveis (1986) - IMDb
0,0,1,0,0,0
1,0,0,1,0,0
2,0,0,0,1,0
3,0,0,0,0,1
4,1,0,0,0,0

Podemos usar o comando ``pd.concat``para concatenar as duas bases

In [116]:
df_filmes = pd.concat([df_filmes, df_dum], axis=1)

In [117]:
df_filmes

,name,obs,rate,A Lista de Schindler (1993) - IMDb,Dunkirk (2017) - IMDb,Piratas do Caribe: A Vinganca de Salazar (2017) - IMDb,Soul Surfer: Coragem de Viver (2011) - IMDb,Top Gun: Ases Indomaveis (1986) - IMDb
0,Dunkirk (2017) - IMDb,545.102,7.9,0,1,0,0,0
1,Piratas do Caribe: A Vinganca de Salazar (2017...,259.809,6.5,0,0,1,0,0
2,Soul Surfer: Coragem de Viver (2011) - IMDb,45.333,7.0,0,0,0,1,0
3,Top Gun: Ases Indomaveis (1986) - IMDb,292.146,6.9,0,0,0,0,1
4,A Lista de Schindler (1993) - IMDb,1.200.891,8.9,1,0,0,0,0

In [120]:
df_filmes.to_latex()

'\\begin{tabular}{lllrrrrrr}\n\\toprule\n{} &                                               name &        obs &  rate &  A Lista de Schindler (1993) - IMDb &  Dunkirk (2017) - IMDb &  Piratas do Caribe: A Vinganca de Salazar (2017) - IMDb &  Soul Surfer: Coragem de Viver (2011) - IMDb &  Top Gun: Ases Indomaveis (1986) - IMDb \\\\\n\\midrule\n0 &                              Dunkirk (2017) - IMDb &    545.102 &   7.9 &                                   0 &                      1 &                                                  0 &                                            0 &                                       0 \\\\\n1 &  Piratas do Caribe: A Vinganca de Salazar (2017... &    259.809 &   6.5 &                                   0 &                      0 &                                                  1 &                                            0 &                                       0 \\\\\n2 &        Soul Surfer: Coragem de Viver (2011) - IMDb &     45.333 &   7.0 &                                   0 &                      0 &                                                  0 &                                            1 &                                       0 \\\\\n3 &             Top Gun: Ases Indomaveis (1986) - IMDb &    292.146 &   6.9 &                                   0 &                      0 &                                                  0 &                                            0 &                                       1 \\\\\n4 &                 A Lista de Schindler (1993) - IMDb &  1.200.891 &   8.9 &                                   1 &                      0 &                                                  0 &                                            0 &                                       0 \\\\\n\\bottomrule\n\\end{tabular}\n'

In [1]:
import pandas as pd
import pickle

In [3]:
df = pd.read_pickle('dados.pkl')